Documents/УДАЛИТЬРемонтОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УДАЛИТЬРемонтОС</Name>
			<Comment>(Общ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.БракВПроизводстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СобытиеОС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУВнеоборотногоАктива</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВаловыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительОтдела</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтоНеВыполнено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтоИзменилось</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОбщийСпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьУУ</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРемонтаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРемонтаНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРемонтаУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КодыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КодыОрганизации</Name>
			<Comment>Параметры регистрации и коды организации </Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Comment>Номер регистрации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемЗарегистрирована</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииПФ</Name>
					<Comment>Номер регистрации в ПФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииВСлужбеЗанятости</Name>
					<Comment>Номер регистрации в службе занятости</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяИнспекция</Name>
					<Comment>Налоговая инспекция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>Код ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Индивидуальный налоговый номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЗКГНГ</Name>
					<Comment>Код по ЗКГНГ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСПОДУ</Name>
					<Comment>Код по СПОДУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКВЕД</Name>
					<Comment>Код по КВЕД</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Comment>Код по КОАТУУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКФВ</Name>
					<Comment>Код КФВ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФСС</Name>
					<Comment>Номер регистрации ФСС от временной потери трудоспособности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССНесчСлучай</Name>
					<Comment>Номер регистрации в ФСС от несчастного случая</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганГУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеРабочегоОрганаФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОДиректораФонда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассПрофессиональногоРиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганСоциальнойЗащитыНаселения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССУ</Name>
					<Comment>Номер регистрации ФСС Украины</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКАТОТТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УДАЛИТЬРемонтОС/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

#Если Клиент Тогда

// Функция формирует табличный документ унифицированной формы ОЗ-2
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ по форме ОЗ-2.
//
Функция ПечатьОЗ2(ПечатьПоДаннымУпрУчета = Истина)

	Макет       = ПолучитьОбщийМакет("ОЗ2");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма_ОЗ2";
	
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("Период"            , МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация"    , Организация);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер"  , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.УстановитьПараметр("РуководительОтдела", РуководительОтдела);
	Запрос.УстановитьПараметр("Сдал"              , Сдал);
	Запрос.УстановитьПараметр("Принял"            , Принял);
	Запрос.УстановитьПараметр("Ссылка"            , Ссылка);
	
	Если Не ПечатьПоДаннымУпрУчета Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизации.Организация.НаименованиеПолное               КАК Организация,
		|	КодыОрганизации.КодПоЕДРПОУ                                  КАК ЕДРПОУ,
		|	РемонтОС.Номер                                               КАК НомерАкта,
		|	РемонтОС.Дата                                                КАК ДатаАкта,
		|	РемонтОС.СобытиеОС                                           КАК ВидОперации,
		|	РемонтОС.СчетУчетаБУВнеоборотногоАктива                      КАК СчетКт,
		|	РемонтОС.ДатаНачалаРемонта                                   КАК ДатаНачала,
		|	РемонтОС.ДатаОкончанияРемонта                                КАК ДатаОкончания,
		|	РемонтОС.ЧтоНеВыполнено                                      КАК ЧтоНеВыполнено,
		|	РемонтОС.ЧтоИзменилось                                       КАК ЧтоИзменилось,
		|	РАЗНОСТЬДАТ(РемонтОС.ДатаНачалаРемонта,
		|	            РемонтОС.ДатаОкончанияРемонта,
		|	            ДЕНЬ)                                             КАК КоличествоДней,
		|	ФИОГлавногоБухгалтера.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОГлавногоБухгалтера.Имя, 1, 1) + "". "" 
		|		+ ПОДСТРОКА(ФИОГлавногоБухгалтера.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер,
		|	ФИОРуководителяОтдела.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОРуководителяОтдела.Имя, 1, 1) + "". "" 
		|		+ ПОДСТРОКА(ФИОРуководителяОтдела.Отчество, 1, 1) + ""."" КАК РуководительОтдела,
		|	ФИОСдал.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОСдал.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОСдал.Отчество, 1, 1) + "".""               КАК Сдал,
		|	ФИОПринял.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОПринял.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОПринял.Отчество, 1, 1) + "".""             КАК Принял,
		|	ДолжностьСдал.Должность                                       КАК СдалДолжность,
		|	ДолжностьПринял.Должность                                     КАК ПринялДолжность
		|ИЗ
		|	Документ.РемонтОС КАК РемонтОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.КодыОрганизации.СрезПоследних(
		|			                &Период,
		|			                Организация = &ТекОрганизация) КАК КодыОрганизации
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И Сотрудник.Физлицо = &Сдал) КАК ДолжностьСдал
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И Сотрудник.Физлицо = &Принял) КАК ДолжностьПринял
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		                    &Период,
		|		                    ФизЛицо В
		|		                    (ВЫБРАТЬ
		|		                        ОтветственныеЛица.ФизическоеЛицо
		|		                    ИЗ
		|		                        РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|		                                        &Период,
		|		                                        СтруктурнаяЕдиница = &ТекОрганизация
		|		                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
		|			                 ) КАК ФИОГлавногоБухгалтера
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период, 
		|			                ФизЛицо = &РуководительОтдела) КАК ФИОРуководителяОтдела
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период,
		|			                ФизЛицо = &Сдал) КАК ФИОСдал
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период,
		|			                ФизЛицо = &Принял) КАК ФИОПринял
		|		ПО (ИСТИНА)
		|ГДЕ
		|	РемонтОС.Ссылка = &Ссылка";
		ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
		ВыборкаПоШапке.Следующий();
    КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("Период",         МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	
	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	Запрос.УстановитьПараметр("СписокОС",       СписокОС);
	
	Если ПечатьПоДаннымУпрУчета Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РемонтОСОС.Ссылка.Номер                        КАК НомерАкта,
		|	РемонтОСОС.Ссылка.Дата                         КАК ДатаАкта,
		|	РемонтОСОС.Ссылка.СобытиеОС                    КАК ВидОперации,
		|	РемонтОСОС.ОсновноеСредство.Код                КАК ИнвентарныйНомер,
		|	РемонтОСОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
		|	РемонтОСОС.ОсновноеСредство.НаименованиеПолное КАК ОсновноеСредствоНаименование,
		|	РемонтОСОС.СуммаРемонтаУУ                      КАК СуммаРемонта,
		|	РемонтОСОС.Ссылка.Сдал       				   КАК Сдал,
		|	РемонтОСОС.Ссылка.Принял       				   КАК Принял,
		|	РемонтОСОС.Ссылка.ДатаНачалаРемонта            КАК ДатаНачала,
		|	РемонтОСОС.Ссылка.ДатаОкончанияРемонта         КАК ДатаОкончания,
		|	РемонтОСОС.Ссылка.ЧтоНеВыполнено               КАК ЧтоНеВыполнено,
		|	РемонтОСОС.Ссылка.ЧтоИзменилось                КАК ЧтоИзменилось,
		|	РАЗНОСТЬДАТ(РемонтОСОС.Ссылка.ДатаНачалаРемонта,
		|	            РемонтОСОС.Ссылка.ДатаОкончанияРемонта,
		|	            ДЕНЬ)                              КАК КоличествоДней,
		|	МестонахождениеОС.МОЛ.Код                      КАК КодМОЛа,
		|	МестонахождениеОС.Местонахождение.Наименование КАК Подразделение
		|ИЗ
		|	Документ.РемонтОС.ОС КАК РемонтОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОС
		|		ПО РемонтОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|ГДЕ
		|	РемонтОСОС.Ссылка = &Ссылка";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РемонтОСОС.ОсновноеСредство.ЗаводскойНомер             КАК ЗаводскойНомер,
		|	РемонтОСОС.ОсновноеСредство.НаименованиеПолное         КАК ОсновноеСредствоНаименование,
		|	РемонтОСОС.СуммаРемонтаБУ                              КАК СуммаРемонта,
		|	СчетаБухгалтерскогоУчетаОС.СчетУчета                   КАК СчетДт,
		|	ПервоначальныеСведенияОС.ИнвентарныйНомер              КАК ИнвентарныйНомер,
		|	МестонахождениеОС.МОЛ.Код                              КАК КодМОЛа,
		|	МестонахождениеОС.Местонахождение.Наименование         КАК Подразделение
		|ИЗ
		|	Документ.РемонтОС.ОС КАК РемонтОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК СчетаБухгалтерскогоУчетаОС
		|		ПО РемонтОСОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС
		|		ПО РемонтОСОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОС
		|		ПО РемонтОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|ГДЕ
		|	РемонтОСОС.Ссылка = &Ссылка";
		
	КонецЕсли;	
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	НеПервая = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если НеПервая Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ2");
		
		Если Не ПечатьПоДаннымУпрУчета Тогда
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
			//ОбластьМакета.Параметры.Организация = СокрП(ВыборкаПоШапке.Организация);
			
		Иначе
			
			ОбластьМакета.Параметры.Организация = "Управлінський облік";
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
			
		ТабДокумент.Вывести(ОбластьМакета);
		НеПервая = Истина;
	
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ2()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОЗ2упр" тогда
		
		// Управленческая печатная форма документа
		ТабДокумент = ПечатьОЗ2();
		
	ИначеЕсли ИмяМакета = "ОЗ2бух" тогда
		ТабДокумент = ПечатьОЗ2(Ложь);
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НСтр("ru='Ремонт ОС';uk='Ремонт ОЗ'")), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ОЗ2упр,ОЗ2бух",НСтр("ru='Форма ОЗ-2(упр. учет)';uk='Форма ОЗ-2(упр. облік)'"),НСтр("ru='Форма ОЗ-2(бух. учет)';uk='Форма ОЗ-2(бух. облік)'"));

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

	мСтрокаРеквизитыБухУчета =  "СтоимостьБУ,
								|СчетУчетаБУВнеоборотногоАктива,
								|ИспользоватьОбщийСпособОтраженияРасходов,
								|СпособОтраженияРасходов,
								|ОС.СуммаРемонтаБУ";

	мСтрокаРеквизитыНалУчета =  "СтоимостьНУ,
								|ОС.СуммаРемонтаНУ";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "СобытиеОС, ОбъектСтроительства";
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", Организация, СчетУчетаБУВнеоборотногоАктива";
	КонецЕсли;	
	
	Если СтруктураШапкиДокумента.ИспользоватьОбщийСпособОтраженияРасходов Тогда
		
		ОбязательныеРеквизитыШапки = ОбязательныеРеквизитыШапки + ", СпособОтраженияРасходов";
		
	КонецЕсли;
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
		 Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.НалоговоеНазначениеОбъектаСтроительства) Тогда
			 
			 ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено налоговое назначение у объекта строительства';uk=""Не заповнене податкове призначення в об'єкта будівництва"""), Отказ, Заголовок);
		 	
		 КонецЕсли;
		
	КонецЕсли;
	
	//Проверим на виды операций, которые не будут полностью отработаны в данном документе
	Если СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.ПодготовкаКПередаче
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.Передача
	или СтруктураШапкиДокумента.ВидСобытияОС = Перечисления.ВидыСобытийОС.Списание
	Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='События с основными средствами с видом <%1>"
"не будут полноценно отражены данным документом (учетное состояние ОС не изменится)!';uk='Події з основними засобами з видом <%1>"
"не будуть повноцінно відображені даним документом (обліковий стан ОЗ не зміниться)!'"), строка(СтруктураШапкиДокумента.ВидСобытияОС)),,Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет заполнение табличной части документа
// для управленческого учета
Процедура ПроверкаРеквизитовТЧУпр(ТаблицаОС, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;	
	КонецЕсли;	
	
	// Проверим что суммы модернизации относимые на каждый объект ОС в сумме равны данным из шапки документа
	Если ТаблицаОС.Итог("СуммаРемонтаУУ")<> СтруктураШапкиДокумента.СтоимостьУУ Тогда
		
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По управленческому учету общая сумма ремонта, указанная в шапке документа, не соответствует в итоге суммам, отнесенным на основные средства!';uk='По управлінському обліку загальна сума ремонту, зазначена в шапці документа, не відповідає в результаті сумам, віднесеним на основні засоби!'"), Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверка реквизитов в ТЧ по регл. учету
// 
Процедура ПроверкаРеквизитовТЧРегл(ТаблицаОС, СтруктураШапкиДокумента, Отказ, Заголовок)

	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;	
	КонецЕсли;	
	
	// Проверим что суммы модернизации относимые на каждый объект ОС в сумме равны данным из шапки документа
	Если ТаблицаОС.Итог("СуммаРемонтаБУ")<> СтруктураШапкиДокумента.СтоимостьБУ Тогда
			
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По бухгалтерскому учету общая сумма ремонта, указанная в шапке документа, не соответствует в итоге суммам, отнесенным на основные средства!';uk='По бухгалтерському обліку загальна сума ремонту, зазначена в шапці документа, не відповідає в результаті сумам, віднесеним на основні засоби!'"), Отказ, Заголовок);
								 
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
		// Проверим что суммы модернизации относимые на каждый объект ОС в сумме равны данным из шапки документа
		Если ТаблицаОС.Итог("СуммаРемонтаНУ")<> СтруктураШапкиДокумента.СтоимостьНУ Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По налоговому учету общая сумма ремонта, указанная в шапке документа, не соответствует в итоге суммам, отнесенным на основные средства!';uk='По податковому обліку загальна сума ремонту, зазначена в шапці документа, не відповідає в результаті сумам, віднесеним на основні засоби!'"), Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт

	РеквизитыТабОС = "ОсновноеСредство"; //через запятую
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура(РеквизитыТабОС), Отказ, Заголовок);

	// Логические проверки
	ПроверкаРеквизитовТЧУпр(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок);
	ПроверкаРеквизитовТЧРегл(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок);

КонецПроцедуры // ПроверкаРеквизитов()

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаНаправлений, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаНаправлений, Отказ, Заголовок);

	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок);
	
КонецПроцедуры

// По результату запроса по шапке документа формируем движения по регистрам для целей упр. учета.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаНаправлений, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	ДатаДока = Дата;

	СобытияОС              = Движения.СобытияОС;
	НазваниеДокумента      = Метаданные().Представление();

	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТабАмортизации.Колонки.Добавить("ОбъектУчета",            Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТабАмортизации.Колонки.Добавить("Амортизация",            ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТекНаправление = СтруктураШапкиДокумента.СпособОтраженияРасходов;
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл

		ТекОС = СтрокаТЧ.ОсновноеСредство;

		// Движения по регистру СобытияОС
		Движение = СобытияОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Событие              = СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента    = НазваниеДокумента;
		Движение.НомерДокумента       = Номер;
		Движение.СуммаЗатрат          = СтрокаТЧ.СуммаРемонтаУУ;

		Если СтрокаТЧ.СуммаРемонтаУУ > 0 Тогда

			Если ТаблицаНаправлений <> Неопределено Тогда
				
				//Затраты списываются по способу отражения расходов по амортзации
				ТекНаправление = ТаблицаНаправлений.Найти(СтрокаТЧ.ОсновноеСредство,"ОС_УУ");
				ТекНаправление = ?(ТекНаправление = Неопределено, Неопределено, ТекНаправление.Направление_УУ);
				                                          
			КонецЕсли;

			НоваяСтрока    = ТабАмортизации.Добавить();

			НоваяСтрока.Амортизация            = СтрокаТЧ.СуммаРемонтаУУ;
			НоваяСтрока.ОбъектУчета            = СтрокаТЧ.ОсновноеСредство;
			НоваяСтрока.НаправлениеАмортизации = ТекНаправление;

		КонецЕсли;

	КонецЦикла;

	// вызов процедуры списания амортизации по направлениям
	УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента);

	
	// Движения по регистру Строительство
	СтроительствоОС       = Движения.СтроительствоОбъектовОсновныхСредств;
	ТаблицаСтроительство = СтроительствоОС.Выгрузить();
	
	Движение = ТаблицаСтроительство.Добавить();
	Движение.ОбъектСтроительства        = СтруктураШапкиДокумента.ОбъектСтроительства;
	Движение.Сумма                      = ТаблицаПоОС.Итог("СуммаРемонтаУУ");
	
	СтроительствоОС.мПериод          = ДатаДока;
	СтроительствоОС.мТаблицаДвижений = ТаблицаСтроительство;
	Движения.СтроительствоОбъектовОсновныхСредств.ВыполнитьРасход();
	
КонецПроцедуры	

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, Отказ, Заголовок)

	Если НЕ ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли; 
							  
	ДатаДока       = Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;

	УправлениеВнеоборотнымиАктивами.ДополнитьТабличнуюЧастьСведениямиОбОСБухНалогРегл(МоментВремени(), ТаблицаПоОС,
	                                                  СтруктураШапкиДокумента, 
													  Отказ, Заголовок, , Истина);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;								
													  
	ОперацииОС             = Движения.СобытияОСОрганизаций;
	ПроводкиБУ             = Движения.Хозрасчетный;
	
	// Подготовим таблицу с данными по амортизации для начисления амортизации по направлениям затрат
	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации",
	                                Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТабАмортизации.Колонки.Добавить("ОбъектУчета", 
	                                Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТабАмортизации.Колонки.Добавить("Сумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТабАмортизации.Колонки.Добавить("СчетАмортизации");
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл

		ТекОС = СтрокаТЧ.ОсновноеСредство;

		// Движения по регистру СобытияОСОрганизаций
		Движение = ОперацииОС.Добавить();
		Движение.Период				= ДатаДока;
		Движение.ОсновноеСредство	= ТекОС;
		Движение.Организация		= ТекОрганизация;
		Движение.Событие 			= СтруктураШапкиДокумента.СобытиеОС;
		Движение.НазваниеДокумента	= Строка(СтруктураШапкиДокумента.Ссылка.Метаданные());
		Движение.НомерДокумента		= СтруктураШапкиДокумента.Номер;
		Движение.СуммаЗатратБУ		= СтрокаТЧ.СуммаРемонтаБУ;
		
		// списание сумм ремонта на затраты
		СуммаРемонта = СтрокаТЧ.СуммаРемонтаБУ;
		
		Если СуммаРемонта <> 0 Тогда
			
			НоваяСтрока = ТабАмортизации.Добавить();
			
			НоваяСтрока.Сумма                  = СуммаРемонта;
			НоваяСтрока.ОбъектУчета            = ТекОС;
			НоваяСтрока.НаправлениеАмортизации = ?(СтруктураШапкиДокумента.ИспользоватьОбщийСпособОтраженияРасходов,
			                                       СтруктураШапкиДокумента.СпособОтраженияРасходов,
												   СтрокаТЧ.НаправлениеБУ);
			НоваяСтрока.СчетАмортизации        = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;

		КонецЕсли;
		
	КонецЦикла;
		
	// Вызов процедуры списания ремонта по направлениям.
	// Создаются движения по начислению амортизации.
	УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект,
													   Отказ,
													   Заголовок,
													   ТабАмортизации,
													   СтруктураШапкиДокумента,
													   "ОС");

	Если СтруктураШапкиДокумента.ОтражатьВНалоговомУчете И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда 
		
		ПроводкиНУ                      = Движения.Налоговый;
		НалоговоеНазначениеОбъектаСтр   = СтруктураШапкиДокумента.НалоговоеНазначениеОбъектаСтроительства;
		СчетУчетаОбъектаСтроительстваНУ = ПланыСчетов.Налоговый.СтроительствоОбъектовОсновныхСредств;
		ВидНалоговойДеятельности        = НалоговоеНазначениеОбъектаСтр.ВидНалоговойДеятельности;
		ВидДеятельностиНДС              = НалоговоеНазначениеОбъектаСтр.ВидДеятельностиНДС;

		Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл

			ТекОС = СтрокаТЧ.ОсновноеСредство;
			
			Если СтрокаТЧ.НалоговоеНазначение_ОС <> НалоговоеНазначениеОбъектаСтр Тогда
				
				// Допускается не совпадение только признака Амортизируется
				Если СтрокаТЧ.ВидНалоговойДеятельности_ОС <> ВидНалоговойДеятельности Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Строка %1."
"	Вид налоговой деятельности <%2> "
"	налогового назначения <%3>"
"	основного средства ""%4"""
"	не совпадет с видом налоговой деятельности  <%5>"
"	налогового назначения объекта строительства <%6>."
"	Ремонт в этом случае невозможна.';uk='Рядок %1."
"	Вид податкової діяльності <%2> "
"	податкового призначення <%3>"
"	основного засобу ""%4"""
"	не співпаде з видом податкової діяльності <%5>"
"	податкового призначення об''єкта будівництва <%6>."
"	Ремонт в цьому випадку неможливий.'"), СтрокаТЧ.НомерСтроки, СтрокаТЧ.ВидНалоговойДеятельности_ОС, СтрокаТЧ.НалоговоеНазначение_ОС, ТекОС, ВидНалоговойДеятельности, НалоговоеНазначениеОбъектаСтр),
										Отказ, Заголовок);
					
				КонецЕсли;
				
				// Допускается не совпадение только признака Амортизируется
				Если СтрокаТЧ.ВидДеятельностиНДС_ОС <> ВидДеятельностиНДС Тогда
					
					ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Строка %1."
"	Вид деятельности НДС <%2> "
"	налогового назначения <%3>"
"	основного средства ""%4"""
"	не совпадет с видом деятельности НДС <%5>"
"	налогового назначения объекта строительства <%6>."
"	Ремонт в этом случае невозможна.';uk='Рядок %1."
"	Вид діяльності ПДВ <%2> "
"	податкового призначення <%3>"
"	основного засобу ""%4"""
"	не співпаде з видом діяльності ПДВ <%5>"
"	податкового призначення об''єкта будівництва <%6>."
"	Ремонт в цьому випадку неможливий.'"), СтрокаТЧ.НомерСтроки, СтрокаТЧ.ВидДеятельностиНДС_ОС, СтрокаТЧ.НалоговоеНазначение_ОС, ТекОС, ВидДеятельностиНДС, НалоговоеНазначениеОбъектаСтр),
										Отказ, Заголовок);
					
				КонецЕсли;
				
				Если Отказ Тогда
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если (СтрокаТЧ.УчитываетсяКакЗапасНУ И НЕ СтрокаТЧ.НеПроизводственноеОСНУ) ИЛИ СтрокаТЧ.НеУчитываетсяКакОСНУ Тогда
				
				Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.СтатьяВаловыхРасходов) Тогда
					
					Если СтрокаТЧ.УчитываетсяКакЗапасНУ Тогда
						ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Строка %1."
"	Основное средство ""%2"" учитывается как запас в налоговом учете."
"	Ремонт в этом случае относится на валовые расходы, а статья не указана.';uk='Рядок %1."
"	Основний засіб ""%2"" ураховується як запас у податковому обліку."
"	Ремонт в цьому випадку відноситься на валові витрати, а стаття не зазначена.'"), СтрокаТЧ.НомерСтроки, ТекОс);
					Иначе
						ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Строка %1."
"	Основное средство ""%2"" не учитывается как ОС в налоговом учете."
"	Ремонт в этом случае относится на валовые расходы, а статья не указана.';uk='Рядок %1."
"	Основний засіб ""%2"" не враховується як ОЗ у податковому обліку."
"	Ремонт в цьому випадку відноситься на валові витрати, а стаття не зазначена.'"), СтрокаТЧ.НомерСтроки, ТекОс);
					КонецЕсли;					
						
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке,
										Отказ, Заголовок);
					Продолжить
					
				КонецЕсли;
				
				//Тогда ремонт списывается на ВР
				СуммаПроводки = СтрокаТЧ.СуммаРемонтаНУ;
				
				Если СуммаПроводки <> 0 Тогда
					
					Проводка = ПроводкиНУ.Добавить();
					
					Проводка.Период       = ДатаДока;
					Проводка.Организация  = ТекОрганизация;
					Проводка.Содержание   = "Ремонт """ + ТекОС + """";
					Проводка.НомерЖурнала = "ОС";
					Проводка.Сумма        = СуммаПроводки;
					
					Проводка.СчетДт       = ПланыСчетов.Налоговый.ВаловыеРасходы;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиНалоговогоУчета"    , СтруктураШапкиДокумента.СтатьяВаловыхРасходов);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидыНалоговойДеятельности", ВидНалоговойДеятельности);
					
					Проводка.СчетКт       = ПланыСчетов.Налоговый.ВаловыеРасходы;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиНалоговогоУчета"    , СтруктураШапкиДокумента.СтатьяВаловыхРасходов);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыНалоговойДеятельности", ВидНалоговойДеятельности);
					
					Проводка = ПроводкиНУ.Добавить();
					
					Проводка.Период       = ДатаДока;
					Проводка.Организация  = ТекОрганизация;
					Проводка.Содержание   = "Ремонт """ + ТекОС + """";
					Проводка.НомерЖурнала = "ОС";
					Проводка.Сумма        = СуммаПроводки;
					
					Проводка.СчетКт       = СчетУчетаОбъектаСтроительстваНУ;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбъектыСтроительства"     , СтруктураШапкиДокумента.ОбъектСтроительства);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыНалоговойДеятельности", ВидНалоговойДеятельности);
					
				КонецЕсли;
				
				Продолжить
				
			КонецЕсли;
			
			НалоговаяГруппаОС = СтрокаТЧ.НалоговаяГруппаОС;

			//Д  ОМО(Пообъектно = Истина) или ОМГ (Пообъектно = Ложь)
			СуммаПроводки = СтрокаТЧ.СуммаРемонтаНУ;

			Если СуммаПроводки <> 0 Тогда

				Проводка = ПроводкиНУ.Добавить();

				Проводка.Период       = ДатаДока;
				Проводка.Организация  = ТекОрганизация;
				Проводка.Содержание   = "Ремонт """ + ТекОС + """";
				Проводка.НомерЖурнала = "ОС";
				Проводка.Сумма        = СуммаПроводки;
				
				Проводка.СчетДт       = СтрокаТЧ.СчетМодернизацииНУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства"         , ТекОС);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ГруппыОсновныхСредств"    , НалоговаяГруппаОС);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидыНалоговойДеятельности", СтрокаТЧ.ВидНалоговойДеятельности_ОС);
				
				Проводка.СчетКт       = СчетУчетаОбъектаСтроительстваНУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбъектыСтроительства"     , СтруктураШапкиДокумента.ОбъектСтроительства);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыНалоговойДеятельности", ВидНалоговойДеятельности);

			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	
КонецПроцедуры							  

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ,РежимПроведения)
	
	ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='В редакции 1.2 документ не используется! Вместо него следует использовать ""Модернизация и ремонт ОС""';uk='В редакції 1.2 документ не використовується! Замість нього треба використовувати ""Модернізація та ремонт ОЗ""'"), Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	СтруктураШапкиДокумента.Вставить("ВидСобытияОС",
	                                 СтруктураШапкиДокумента.СобытиеОС.ВидСобытияОС);
	СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеОбъектаСтроительства", 
	                                 СтруктураШапкиДокумента.ОбъектСтроительства.НалоговоеНазначение);
                                                                                                    
	// Получим данные учетной политики                                                             
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;

	СтруктураПолей.Вставить("ОсновноеСредство", "ОсновноеСредство");

	СтруктураПолей.Вставить("СуммаРемонтаУУ"  , "СуммаРемонтаУУ");
	СтруктураПолей.Вставить("СуммаРемонтаБУ"  , "СуммаРемонтаБУ");
	СтруктураПолей.Вставить("СуммаРемонтаНУ"  , "СуммаРемонтаНУ");

	РезультатЗапросаПоОС = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей);
	ТаблицаПоОС          = РезультатЗапросаПоОС.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоОС, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	//проверка, нет ли списанных ОС в табличной части
	УправлениеВнеоборотнымиАктивами.ПроверитьНаСписанность(Дата, Организация, ТаблицаПоОС, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(ОС, "ОсновноеСредство", "Основное средство", Отказ, Заголовок);

	// подготовка таблицы для списания
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекПериод",      МоментВремени());
	СписокОС = ТаблицаПоОС.ВыгрузитьКолонку("ОсновноеСредство");
	Запрос.УстановитьПараметр("СписокОС",       СписокОС);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпособыОтраженияРасходов_УУ.ОсновноеСредство КАК ОС_УУ,
	               |	СпособыОтраженияРасходов_УУ.СпособыОтраженияРасходовПоАмортизации КАК Направление_УУ
	               |ИЗ
	               |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних(&ТекПериод, ОсновноеСредство В (&СписокОС)) КАК СпособыОтраженияРасходов_УУ";
	ТаблицаНаправлений = Запрос.Выполнить().Выгрузить();

	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаНаправлений, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
